<template>
  <div>
    <h2>{{newsinfo.title}}</h2>
    <p>
      <span>发表时间：{{newsinfo.time | datafomate}}</span>
      <span>点击{{newsinfo.click}}次</span>
    </p>
    <hr>
    <div v-html="newsinfo.content"></div>

      <!-- 评论组件 -->

     <coment></coment>

  </div>
</template>
<script>
import coment from './coment'
export default {
  name: "newsinfo",
  created(){
    console.log(this.$route)
  },
  data() {
    return {
      id:this.$route.params,
      newsinfo: {
        title: "迪奥",
        time:new Date(),
        click:2,
        content:"<h3>迪奥产品</h3><p>快递师傅老师看见对方就考虑到上岛咖啡上快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛岛咖啡收快递费速度快放假圣诞节疯狂送到路口附近开连锁店发送快递费束带结发开始交电费收到反馈说的房价开始的减肥速度快解放凉快圣诞节疯狂了圣诞快乐附近开始了对方克鲁赛德斯柯达</p><h3>迪奥产品</h3><p>快递师傅老师看见对方就考虑到上岛咖啡上快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛快递师傅老师看见对方就考虑到上岛咖啡上岛岛咖啡收快递费速度快放假圣诞节疯狂送到路口附近开连锁店发送快递费束带结发开始交电费收到反馈说的房价开始的减肥速度快解放凉快圣诞节疯狂了圣诞快乐附近开始了对方克鲁赛德斯柯达</p>"
      }
    };
  },
  components:{
    "coment":coment
  }
};
</script>
<style scoped>
</style>